/** @file

;******************************************************************************
;* Copyright (c) 2014, Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corporation.
;*
;******************************************************************************
*/

/=#
#string STR_PCI_CONFIG_HELP                                #language en-US        "PCI Configuration."
                                                           #language fr-FR        "Configuration PCI."
                                                           #language zh-TW        "PCI \wide設定\narrow."
                                                           #language ja-JP        "PCI \wide設定\narrow."
                                                           #language it-IT        "Configurazione PCI"
                                                           #language es-ES        "Configuración PCI"
                                                           #language de-DE        "PCI Konfiguration"
                                                           #language pt-PT        "Configuração PCI"
#string STR_PCIE_OPTIONS_FORM_TITLE                        #language en-US  "PCI Express Configuration"
#string STR_PCIE_OPTIONS_FORM_HELP                         #language en-US  "PCI Express Configuration Settings"
#string STR_PCIE_SPEED_PROMPT0                             #language en-US "PCIe 0 Speed"
#string STR_PCIE_SPEED_PROMPT1                             #language en-US "PCIe 1 Speed"
#string STR_PCIE_SPEED_PROMPT2                             #language en-US "PCIe 2 Speed"
#string STR_PCIE_SPEED_PROMPT3                             #language en-US "PCIe 3 Speed"
#string STR_PCIE_SPEED_HELP                                #language en-US "Configure PCIe Speed"
#string STR_GEN1                                           #language en-US "Gen1"
#string STR_GEN2                                           #language en-US "Gen2"
#string STR_ICH_PCIERP1_PROMPT                             #language en-US  "PCI Express Root Port 1"
#string STR_ICH_PCIERP2_PROMPT                             #language en-US  "PCI Express Root Port 2"
#string STR_ICH_PCIERP3_PROMPT                             #language en-US  "PCI Express Root Port 3"
#string STR_ICH_PCIERP4_PROMPT                             #language en-US  "PCI Express Root Port 4"
#string STR_ICH_PCIERP_HELP                                #language en-US  "Control the PCI Express Root Port."
#string STR_ICH_PCIERP_DISABLE_HELP                        #language en-US  "This Root Port is disabled because Root Port 1 is disabled."

//
// PCI Express
//
#string STR_PCIE_CONFIG_FORM_TITLE                         #language en-US "PCI Express Configuration"
                                                           #language zh-TW "PCI Express \wide組態\narrow"
#string STR_PCIE_CONFIG_FORM_HELP                          #language en-US "PCI Express Configuration Settings"
                                                           #language zh-TW "PCI Express \wide組態設定\narrow"
#string STR_PCIE_CLOCK_GATINT_PROMPT                       #language en-US "PCI Express Clock Gating"
                                                           #language zh-TW "PCI Express Clock Gating"
#string STR_PCIE_CLOCK_GATINT_HELP                         #language en-US "PCI Express Clock Gating Enable/Disable for each root port"
                                                           #language zh-TW "PCI Express Clock Gating Enable/Disable for each root port"
#string STR_DMI_LINK_ASPM_PROMPT                           #language en-US "DMI Link ASPM Control"
                                                           #language zh-TW "DMI Link ASPM Control"
#string STR_DMI_LINK_ASPM_HELP                             #language en-US "The control of Active State Power Management on both NB side and SB side of the DMI Link."
                                                           #language zh-TW "The control of Active State Power Management on both NB side and SB side of the DMI Link."
#string STR_AUTOMATIC_ASPM_PROMPT                          #language en-US "Automatic ASPM"
                                                           #language zh-TW "Automatic ASPM"
#string STR_AUTOMATIC_ASPM_HELP                            #language en-US "Automatically enable ASPM based on reported capabilities and known issues"
                                                           #language zh-TW "Automatically enable ASPM based on reported capabilities and known issues"
#string STR_L0S_TEXT                                       #language en-US "L0s"
                                                           #language zh-TW "L0s"
#string STR_L1_TEXT                                        #language en-US "L1"
                                                           #language zh-TW "L1"
#string STR_L0SL1_TEXT                                     #language en-US "L0sL1"
                                                           #language zh-TW "L0sL1"
#string STR_PCIERP1_OPTIONS_FORM_TITLE                      #language en-US "PCI Express Root Port 1"
                                                            #language zh-TW  "PCI Express\wide根埠\narrow1"
#string STR_PCIERP1_OPTIONS_FORM_HELP                       #language en-US "PCI Express Root Port 1 Settings. Disable this will also disable PCI Express Root Port 2 ~ 6."
                                                            #language zh-TW "PCI Express\wide根埠\narrow1\wide設定\narrow. \wide停用此裝置將連帶停用\narrowPCI Express\wide根埠\narrow2 ~ 6."
#string STR_PCIERP2_OPTIONS_FORM_TITLE                      #language en-US "PCI Express Root Port 2"
                                                            #language zh-TW "PCI Express\wide根埠\narrow2"
#string STR_PCIERP2_OPTIONS_FORM_HELP                       #language en-US "PCI Express Root Port 2 Settings"
                                                            #language zh-TW "PCI Express\wide根埠\narrow2\wide設定\narrow"
#string STR_PCIERP3_OPTIONS_FORM_TITLE                      #language en-US "PCI Express Root Port 3"
                                                            #language zh-TW "PCI Express\wide根埠\narrow3"
#string STR_PCIERP3_OPTIONS_FORM_HELP                       #language en-US "PCI Express Root Port 3 Settings"
                                                            #language zh-TW "PCI Express\wide根埠\narrow3\wide設定\narrow"
#string STR_PCIERP4_OPTIONS_FORM_TITLE                      #language en-US "PCI Express Root Port 4"
                                                            #language zh-TW "PCI Express\wide根埠\narrow4"
#string STR_PCIERP4_OPTIONS_FORM_HELP                       #language en-US "PCI Express Root Port 4 Settings"
                                                            #language zh-TW "PCI Express\wide根埠\narrow4\wide設定\narrow"
#string STR_PCIERP5_OPTIONS_FORM_TITLE                      #language en-US "PCI Express Root Port 5"
                                                            #language zh-TW "PCI Express\wide根埠\narrow5"
#string STR_PCIERP5_OPTIONS_FORM_HELP                       #language en-US "PCI Express Root Port 5 Settings"
                                                            #language zh-TW "PCI Express\wide根埠\narrow5\wide設定\narrow"
#string STR_PCIERP6_OPTIONS_FORM_TITLE                      #language en-US "PCI Express Root Port 6"
                                                            #language zh-TW "PCI Express\wide根埠\narrow6"
#string STR_PCIERP6_OPTIONS_FORM_HELP                       #language en-US "PCI Express Root Port 6 Settings"
                                                            #language zh-TW "PCI Express\wide根埠\narrow6\wide設定\narrow"
#string STR_PCIERP7_OPTIONS_FORM_TITLE                      #language en-US "PCI Express Root Port 7"
                                                            #language zh-TW "PCI Express\wide根埠\narrow7"
#string STR_PCIERP7_OPTIONS_FORM_HELP                       #language en-US "PCI Express Root Port 7 Settings"
                                                            #language zh-TW "PCI Express\wide根埠\narrow7\wide設定\narrow"
#string STR_PCIERP8_OPTIONS_FORM_TITLE                      #language en-US "PCI Express Root Port 8"
                                                            #language zh-TW "PCI Express\wide根埠\narrow8"
#string STR_PCIERP8_OPTIONS_FORM_HELP                       #language en-US "PCI Express Root Port 8 Settings"
                                                            #language zh-TW "PCI Express\wide根埠\narrow8\wide設定\narrow"
#string STR_PCIERP1_PROMPT                                  #language en-US  "PCI Express Root Port 1"
                                                            #language zh-TW  "PCI Express\wide根埠\narrow1"
#string STR_PCIERP2_PROMPT                                  #language en-US  "PCI Express Root Port 2"
                                                            #language zh-TW  "PCI Express\wide根埠\narrow2"
#string STR_PCIERP3_PROMPT                                  #language en-US  "PCI Express Root Port 3"
                                                            #language zh-TW  "PCI Express\wide根埠\narrow3"
#string STR_PCIERP4_PROMPT                                  #language en-US  "PCI Express Root Port 4"
                                                            #language zh-TW  "PCI Express\wide根埠\narrow4"
#string STR_PCIERP5_PROMPT                                  #language en-US  "PCI Express Root Port 5"
                                                            #language zh-TW  "PCI Express\wide根埠\narrow5"
#string STR_PCIERP6_PROMPT                                  #language en-US  "PCI Express Root Port 6"
                                                            #language zh-TW  "PCI Express\wide根埠\narrow6"
#string STR_PCIERP7_PROMPT                                  #language en-US  "PCI Express Root Port 7"
                                                            #language zh-TW  "PCI Express\wide根埠\narrow7"
#string STR_PCIERP8_PROMPT                                  #language en-US  "PCI Express Root Port 8"
                                                            #language zh-TW  "PCI Express\wide根埠\narrow8"
#string STR_PCIERP_HELP                                     #language en-US  "Control the PCI Express Root Port."
                                                            #language zh-TW  "\wide控制\narrowPCI Express\wide根埠\narrow"
#string STR_PCIERP_DISABLE_HELP                             #language en-US  "This Root Port is disabled because Root Port 1 is disabled."


#string STR_PCIE_URR_PROMPT                                 #language en-US  "  URR"
                                                            #language zh-TW  "  URR\wide設定\narrow"
#string STR_PCIE_URR_HELP                                   #language en-US  "PCI Express Unsupported Request Reporting Enable/Disable."
                                                            #language zh-TW  "PCI Express\wide不支援要求的回報 啟用或停用\narrow"

#string STR_PCIE_FER_PROMPT                                 #language en-US  "  FER"
                                                            #language zh-TW  "  FER\wide設定\narrow"
#string STR_PCIE_FER_HELP                                   #language en-US  "PCI Express Device Fatal Error Reporting Enable/Disable."
                                                            #language zh-TW  "PCI Expres\wide裝置嚴重錯誤回報 啟用或停用\narrow"

#string STR_PCIE_NFER_PROMPT                                #language en-US  "  NFER"
                                                            #language zh-TW  "  NFER\wide設定\narrow"
#string STR_PCIE_NFER_HELP                                  #language en-US  "PCI Express Device Non-Fatal Error Reporting Enable/Disable."
                                                            #language zh-TW  "PCI Express\wide裝置非嚴重錯誤回報 啟用或停用\narrow"

#string STR_PCIE_CER_PROMPT                                 #language en-US  "  CER"
                                                            #language zh-TW  "  CER\wide設定\narrow"
#string STR_PCIE_CER_HELP                                   #language en-US  "PCI Express Device Correctable Error Reporting Enable/Disable."
                                                            #language zh-TW  "PCI Express\wide裝置可校正錯誤回報 啟用或停用\narrow"

#string STR_PCIE_CTO_PROMPT                                 #language en-US  "  CTO"
                                                            #language zh-TW  "  CTO\wide設定\narrow"
#string STR_PCIE_CTO_HELP                                   #language en-US  "PCI Express Completion Timer TO Enable/Disable"
                                                            #language zh-TW  "PCI Express\wide完整計時 啟用或停用\narrow"

#string STR_50_100_US_TEXT                                  #language en-US  "50-100 us"
                                                            #language zh-TW  "50-100 \wide微秒\narrow"
#string STR_1_10_MS_TEXT                                    #language en-US  "1-10 ms"
                                                            #language zh-TW  "1-10 \wide毫秒\narrow"
#string STR_16_55_MS_TEXT                                   #language en-US  "16-55 ms"
                                                            #language zh-TW  "16-55 \wide毫秒\narrow"
#string STR_65_210_MS_TEXT                                  #language en-US  "65-210 ms"
                                                            #language zh-TW  "65-210 \wide毫秒\narrow"
#string STR_260_900_MS_TEXT                                 #language en-US  "260-900 ms"
                                                            #language zh-TW  "260-900 \wide毫秒\narrow"
#string STR_1_3P5_S_TEXT                                    #language en-US  "1-3.5 ms"
                                                            #language zh-TW  "1-3.5 \wide毫秒\narrow"
#string STR_4_13_S_TEXT                                     #language en-US  "4-13 ms"
                                                            #language zh-TW  "4-13 \wide毫秒\narrow"
#string STR_17_64_S_TEXT                                    #language en-US  "17-64 ms"
                                                            #language zh-TW  "17-64 \wide毫秒\narrow"


#string STR_PCIE_SEFE_PROMPT                                #language en-US  "  SEFE"
                                                            #language zh-TW  "  SEFE\wide設定\narrow"
#string STR_PCIE_SEFE_HELP                                  #language en-US  "Root PCI Express System Error on Fatal Error Enable/Disable."
                                                            #language zh-TW  "\wide根\narrowPCI Express\wide系統嚴重錯誤 啟用或停用\narrow"

#string STR_PCIE_SENFE_PROMPT     #language en-US  "  SENFE"
                                  #language zh-TW  "  SENEF\wide設定\narrow"
#string STR_PCIE_SENFE_HELP       #language en-US  "Root PCI Express System Error on Non-Fatal Error Enable/Disable."
                                  #language zh-TW  "\wide根\narrowPCI Express\wide系統非嚴重錯誤 啟用或停用\narrow"

#string STR_PCIE_SECE_PROMPT     #language en-US  "  SECE"
                                 #language zh-TW  "  SECE\wide設定\narrow"
#string STR_PCIE_SECE_HELP       #language en-US  "Root PCI Express System Error on Correctable Error Enable/Disable."
                                 #language zh-TW  "\wide根\narrowPCI Express\wide系統可校正嚴重錯誤 啟用或停用\narrow"


#string STR_PCIE_PME_INT_PROMPT     #language en-US  "  PME Interrupt"
                                    #language zh-TW  "  \wide電源管理事件中斷\narrow"
#string STR_PCIE_PME_INT_HELP       #language en-US  "Root PCI Express PME Interrupt Enable/Disable."
                                    #language zh-TW  "\wide電源管理事件中斷 啟用或停用\narrow"

#string STR_PCIE_PME_SCI_PROMPT    #language en-US  "  PME SCI"
                                   #language zh-TW  "  \wide電源管理事件系統中斷\narrow"
#string STR_PCIE_PME_SCI_HELP      #language en-US  "PCI Express PME SCI Enable/Disable."
                                   #language zh-TW  "\wide電源管理事件系統中斷 啟用或停用\narrow"

#string STR_PCIE_HOT_PLUG_PROMPT    #language en-US  "  Hot Plug"
                                    #language zh-TW  "  \wide熱拔插系統中斷\narrow"
#string STR_PCIE_HOT_PLUG_HELP      #language en-US  "PCI Express Hot Plug Enable/Disable."
                                    #language zh-TW  "\wide熱拔插系統中斷 啟用或停用\narrow"


#string STR_PCIE_ASPM_L0S_PROMPT            #language en-US  "ASPM L0s"
#string STR_PCIE_ASPM_L0S_HELP              #language en-US  "Enable PCIe ASPM L0s."
#string STR_PCIE_ASPM_L0S_RP_STRING         #language en-US   "Root Port Only"
#string STR_PCIE_ASPM_L0S_EP_STRING         #language en-US   "Endpoint Port Only"
#string STR_PCIE_ASPM_L0S_BOTH_STRING       #language en-US   "Root&Endpoint Ports"
#string STR_PCIE_ASPM_L0S_AGGRESSIVE        #language en-US   "Aggressive"
#string STR_PCIE_ASPM_L0S_ULTRA_AGGRESSIVE  #language en-US   "Ultra-Aggressive"
#string STR_PCIE_ASPM_L1_PROMPT     		#language en-US  "ASPM L1"
#string STR_PCIE_ASPM_L1_HELP       		#language en-US  "Enable PCIe ASPM L1."

#string STR_PCI_EXPRESS_CARD_STRING     #language en-US        "Extra Bus Reserved"
                                        #language fr-FR        "Extra Bus Reserved"
                                        #language it-IT        "Extra Bus Reserved"
                                        #language es-ES        "Extra Bus Reserved"
                                        #language de-DE        "Extra Bus Reserved"
#string STR_PCI_EXPRESS_CARD_HELP       #language en-US        "Extra Bus Reserved for bridges behind PCI-E Root Bridge."
#string STR_TO_PCI_TEXT                 #language en-US        "PCI BUS"
                                        #language it-IT        "PCI BUS"
                                        #language es-ES        "PCI BUS"
#string STR_PCI_LATENCY_TIMER_STRING    #language en-US        "PCI Latency Timer"
                                        #language fr-FR        "PCI Temps Retardé"
                                        #language zh-TW        "PCI \wide潛在時間計時器\narrow"
                                        #language it-IT        "PCI Latency Timer"
                                        #language es-ES        "PCI Contador de tiempo de estado latente"
                                        #language de-DE        "PCI Latenzzeit Timer"
                                        #language pt-PT        "PCI Latência Despertador"
#string STR_PCI_LATENCY_TIMER_HELP      #language en-US        "Value to be programmed into PCI Latency Timer Register."
                                        #language fr-FR        "Value to be programmed into PCI Latency Timer Register."
                                        #language zh-TW        "Value to be programmed into PCI Latency Timer Register."
                                        #language ja-JP        "Value to be programmed into PCI Latency Timer Register."
                                        #language it-IT        "Value to be programmed into PCI Latency Timer Register."
                                        #language es-ES        "Value to be programmed into PCI Latency Timer Register."
                                        #language de-DE        "Value to be programmed into PCI Latency Timer Register."
                                        #language pt-PT        "Value to be programmed into PCI Latency Timer Register."		
#string STR_PCIE_ASPM_PROMPT                           #language en-US "ASPM"
#string STR_PCIE_ASPM_PROMPT0                          #language en-US "ASPM"
#string STR_PCIE_ASPM_PROMPT1                          #language en-US "ASPM"
#string STR_PCIE_ASPM_PROMPT2                          #language en-US "ASPM"
#string STR_PCIE_ASPM_PROMPT3                          #language en-US "ASPM"
#string STR_PCIE_ASPM_HELP                             #language en-US "PCI Express Active State Power Management settings"
#string STR_PCIE_ASPM_L0S_STRING                       #language en-US "L0s"
#string STR_PCIE_ASPM_L1_STRING                        #language en-US "L1"
#string STR_PCIE_ASPM_L0SL1_STRING                     #language en-US "L0sL1"

#string STR_PCH_PCIERP1_PROMPT                         #language en-US "PCI Express Root Port 1"
#string STR_PCH_PCIERP2_PROMPT                         #language en-US "PCI Express Root Port 2"
#string STR_PCH_PCIERP3_PROMPT                         #language en-US "PCI Express Root Port 3"
#string STR_PCH_PCIERP4_PROMPT                         #language en-US "PCI Express Root Port 4"
#string STR_PCH_PCIERP5_PROMPT                         #language en-US "PCI Express Root Port 5"
#string STR_PCH_PCIERP6_PROMPT                         #language en-US "PCI Express Root Port 6"
#string STR_PCH_PCIERP_HELP                            #language en-US "Control the PCI Express Root Port"

#string STR_PCIE_EXT_SYNCH_PROMPT                      #language en-US "Extended Synch"
#string STR_PCIE_EXT_SYNCH_HELP                        #language en-US "Enable PCIe Extended Synchronization for Logic Analyzer use"

#string STR_PCH_PCIE_URE_PROMPT                        #language en-US "  URR"
#string STR_PCH_PCIE_URE_PROMPT0                       #language en-US "  URR"
#string STR_PCH_PCIE_URE_PROMPT1                       #language en-US "  URR"
#string STR_PCH_PCIE_URE_PROMPT2                       #language en-US "  URR"
#string STR_PCH_PCIE_URE_PROMPT3                       #language en-US "  URR"
#string STR_PCH_PCIE_URE_HELP                          #language en-US "PCI Express Unsupported Request Reporting Enable/Disable"

#string STR_PCH_PCIE_FEE_PROMPT                        #language en-US "  FER"
#string STR_PCH_PCIE_FEE_PROMPT0                       #language en-US "  FER"
#string STR_PCH_PCIE_FEE_PROMPT1                       #language en-US "  FER"
#string STR_PCH_PCIE_FEE_PROMPT2                       #language en-US "  FER"
#string STR_PCH_PCIE_FEE_PROMPT3                       #language en-US "  FER"
#string STR_PCH_PCIE_FEE_HELP                          #language en-US "PCI Express Device Fatal Error Reporting Enable/Disable"

#string STR_PCH_PCIE_NFE_PROMPT                        #language en-US "  NFER"
#string STR_PCH_PCIE_NFE_PROMPT0                       #language en-US "  NFER"
#string STR_PCH_PCIE_NFE_PROMPT1                       #language en-US "  NFER"
#string STR_PCH_PCIE_NFE_PROMPT2                       #language en-US "  NFER"
#string STR_PCH_PCIE_NFE_PROMPT3                       #language en-US "  NFER"
#string STR_PCH_PCIE_NFE_HELP                          #language en-US "PCI Express Device Non-Fatal Error Reporting Enable/Disable"

#string STR_PCH_PCIE_CEE_PROMPT                        #language en-US "  CER"                                    
#string STR_PCH_PCIE_CEE_PROMPT0                       #language en-US "  CER"
#string STR_PCH_PCIE_CEE_PROMPT1                       #language en-US "  CER"
#string STR_PCH_PCIE_CEE_PROMPT2                       #language en-US "  CER"
#string STR_PCH_PCIE_CEE_PROMPT3                       #language en-US "  CER"
#string STR_PCH_PCIE_CEE_HELP                          #language en-US "PCI Express Device Correctable Error Reporting Enable/Disable"

#string STR_PCH_PCIE_SFE_PROMPT                        #language en-US "  SEFE"                                    
#string STR_PCH_PCIE_SFE_PROMPT0                       #language en-US "  SEFE"                                    
#string STR_PCH_PCIE_SFE_PROMPT1                       #language en-US "  SEFE"
#string STR_PCH_PCIE_SFE_PROMPT2                       #language en-US "  SEFE"
#string STR_PCH_PCIE_SFE_PROMPT3                       #language en-US "  SEFE"
#string STR_PCH_PCIE_SFE_HELP                          #language en-US "Root PCI Express System Error on Fatal Error Enable/Disable"

#string STR_PCH_PCIE_SNE_PROMPT                        #language en-US "  SENFE"                                    
#string STR_PCH_PCIE_SNE_PROMPT0                       #language en-US "  SENFE"
#string STR_PCH_PCIE_SNE_PROMPT1                       #language en-US "  SENFE"
#string STR_PCH_PCIE_SNE_PROMPT2                       #language en-US "  SENFE"
#string STR_PCH_PCIE_SNE_PROMPT3                       #language en-US "  SENFE"
#string STR_PCH_PCIE_SNE_HELP                          #language en-US "Root PCI Express System Error on Non-Fatal Error Enable/Disable"
                                    
#string STR_PCH_PCIE_SCE_PROMPT                       #language en-US "  SECE"
#string STR_PCH_PCIE_SCE_PROMPT0                       #language en-US "  SECE"
#string STR_PCH_PCIE_SCE_PROMPT1                       #language en-US "  SECE"
#string STR_PCH_PCIE_SCE_PROMPT2                       #language en-US "  SECE"
#string STR_PCH_PCIE_SCE_PROMPT3                       #language en-US "  SECE"
#string STR_PCH_PCIE_SCE_HELP                          #language en-US "Root PCI Express System Error on Correctable Error Enable/Disable"

#string STR_PCH_PCIE_PMCE_PROMPT                       #language en-US "  PME SCI"
#string STR_PCH_PCIE_PMCE_PROMPT0                      #language en-US "  PME SCI"
#string STR_PCH_PCIE_PMCE_PROMPT1                      #language en-US "  PME SCI"
#string STR_PCH_PCIE_PMCE_PROMPT2                      #language en-US "  PME SCI"
#string STR_PCH_PCIE_PMCE_PROMPT3                      #language en-US "  PME SCI"
#string STR_PCH_PCIE_PMCE_HELP                         #language en-US "PCI Express PME SCI Enable/Disable"

#string STR_PCH_PCIE_ESE_PROMPT                        #language en-US "  Ext Sync"
#string STR_PCH_PCIE_ESE_PROMPT0                       #language en-US "  Ext Sync"
#string STR_PCH_PCIE_ESE_PROMPT1                       #language en-US "  Ext Sync"
#string STR_PCH_PCIE_ESE_PROMPT2                       #language en-US "  Ext Sync"
#string STR_PCH_PCIE_ESE_PROMPT3                       #language en-US "  Ext Sync"
#string STR_PCH_PCIE_ESE_HELP                          #language en-US "PCI Express Ext Sync Enable/Disable"


#string STR_PCH_PCIE_HPE_PROMPT0                       #language en-US "  Hot Plug"
#string STR_PCH_PCIE_HPE_PROMPT1                       #language en-US "  Hot Plug"
#string STR_PCH_PCIE_HPE_PROMPT2                       #language en-US "  Hot Plug"
#string STR_PCH_PCIE_HPE_PROMPT3                       #language en-US "  Hot Plug"
#string STR_PCH_PCIE_HPE_HELP                          #language en-US "PCI Express Hot Plug Enable/Disable"

#string STR_PCIE_SPEED_PROMPT                          #language en-US "PCIe Speed"
#string STR_PCIE_SPEED_PROMPT0                         #language en-US "PCIe Speed"
#string STR_PCIE_SPEED_PROMPT1                         #language en-US "PCIe Speed"
#string STR_PCIE_SPEED_PROMPT2                         #language en-US "PCIe Speed"
#string STR_PCIE_SPEED_PROMPT3                         #language en-US "PCIe Speed"
#string STR_PCIE_SPEED_HELP                            #language en-US "Configure PCIe Speed, CHV A1 always with Gen1 Speed."
#string STR_AUTO                                       #language en-US "Auto"
#string STR_GEN1                                       #language en-US "Gen1"
#string STR_GEN2                                       #language en-US "Gen2"

#string STR_PCH_PCIE_THS_PROMPT                        #language en-US "  Transmitter Half Swing"
#string STR_PCH_PCIE_THS_PROMPT0                       #language en-US "  Transmitter Half Swing"
#string STR_PCH_PCIE_THS_PROMPT1                       #language en-US "  Transmitter Half Swing"
#string STR_PCH_PCIE_THS_PROMPT2                       #language en-US "  Transmitter Half Swing"
#string STR_PCH_PCIE_THS_PROMPT3                       #language en-US "  Transmitter Half Swing"
#string STR_PCH_PCIE_THS_HELP                          #language en-US "Transmitter Half Swing Enable/Disable."

#string STR_PCIE_L1SUB_PROMPT                          #language en-US "L1 Substates"
#string STR_PCIE_L1SUB_HELP                            #language en-US "PCI Express L1 Substates settings."
#string STR_PCIE_L1SUB_1_STRING                        #language en-US "L1.1"
#string STR_PCIE_L1SUB_2_STRING                        #language en-US "L1.2"
#string STR_PCIE_L1SUB_1_2_STRING                      #language en-US "L1.1 & L1.2"

#string STR_PCH_PCIE_RBUS_PROMPT0                      #language en-US "Extra Bus Reserved"
#string STR_PCH_PCIE_RBUS_PROMPT1                      #language en-US "Extra Bus Reserved"
#string STR_PCH_PCIE_RBUS_PROMPT2                      #language en-US "Extra Bus Reserved"
#string STR_PCH_PCIE_RBUS_PROMPT3                      #language en-US "Extra Bus Reserved"
#string STR_PCH_PCIE_RBUS_HELP                         #language en-US "Extra Bus Reserved (0-7) for bridges behind this Root Bridge"

#string STR_PCH_PCIE_RMEM_PROMPT0                      #language en-US "Reseved Memory"
#string STR_PCH_PCIE_RMEM_PROMPT1                      #language en-US "Reseved Memory"
#string STR_PCH_PCIE_RMEM_PROMPT2                      #language en-US "Reseved Memory"
#string STR_PCH_PCIE_RMEM_PROMPT3                      #language en-US "Reseved Memory"
#string STR_PCH_PCIE_RMEM_HELP                         #language en-US "Reserved Memory and Prefetchable Memory (1-20MB) Range for this Root Bridge"

#string STR_PCH_PCIE_RVIO_PROMPT0                      #language en-US "Reserved I/O"
#string STR_PCH_PCIE_RVIO_PROMPT1                      #language en-US "Reserved I/O"
#string STR_PCH_PCIE_RVIO_PROMPT2                      #language en-US "Reserved I/O"
#string STR_PCH_PCIE_RVIO_PROMPT3                      #language en-US "Reserved I/O"
#string STR_PCH_PCIE_RVIO_HELP                         #language en-US "Reserved I/O (4K/8K/12K/16K/20K) Range for this Root Bridge"								
#string STR_PCH_PCIEX_S0IX_PROMPT                      #language en-US "PCI Express S0ix Settings"
#string STR_PCH_PCIEX_S0IX_HELP                        #language en-US "PCI Express S0ix Settings"

#string STR_PCI_S0IX_PROMPT                            #language en-US "PCIe S0iX"
#string STR_PCI_S0IX_HELP                              #language en-US "Enable/disable S0iX for PCIe"
#string STR_PCH_PCIE_CLKREQ_STS_PROMPT                 #language en-US "Evaluate CLKREQ State"
#string STR_PCH_PCIE_CLKREQ_STS_HELP                   #language en-US "Enable/disable evaluation of CLKREQ state"

#string STR_PCH_PCIE_D0_S0IX_PROMPT                    #language en-US "D0 S0ix Policy"
#string STR_PCH_PCIE_D0_S0IX_HELP                      #language en-US "PCIe D0 S0ix Policy"
#string STR_D0_S0IX_STRING0                            #language en-US "PCIe RC shall be in D3"
#string STR_D0_S0IX_STRING1                            #language en-US "S0i1 is the deepest S0ix state"
#string STR_D0_S0IX_STRING2                            #language en-US "PCIe RC is in D0 when entering S0IX"
#string STR_D0_S0IX_STRING3                            #language en-US "Reserved"

#string STR_PCH_PCIE_CLKREQ_PROMPT                     #language en-US "CLKREQ# Enables"
#string STR_PCH_PCIE_CLKREQ_HELP                       #language en-US "CLKREQ#[x] shall be evaludated during PCIe in D0 S0ix entry and exit criteria checking"
#string STR_CLKREQ_STRING0                             #language en-US "CLKREQ#[0]"
#string STR_CLKREQ_STRING1                             #language en-US "CLKREQ#[1]"
#string STR_CLKREQ_STRING2                             #language en-US "CLKREQ#[2]"
#string STR_CLKREQ_STRING3                             #language en-US "CLKREQ#[3]"

#string STR_PCH_PCIE_LTR_LATSC_PROMPT                  #language en-US "S0ix LTR Threshold (Latency Scale)"
#string STR_PCH_PCIE_LTR_LATSC_HELP                    #language en-US "PCIe S0ix LTR Threshold : Latency Scale"
#string STR_LTR_LAT_SCL_STRING0                        #language en-US "1ns"
#string STR_LTR_LAT_SCL_STRING1                        #language en-US "32ns"
#string STR_LTR_LAT_SCL_STRING2                        #language en-US "1024ns"
#string STR_LTR_LAT_SCL_STRING3                        #language en-US "32,768ns"
#string STR_LTR_LAT_SCL_STRING4                        #language en-US "1,048,576ns"
#string STR_LTR_LAT_SCL_STRING5                        #language en-US "33,554,432ns"

#string STR_PCH_PCIE_LTR_LATVAL_PROMPT                 #language en-US "PCIe S0ix LTR Threshold (Latency Value)"
#string STR_PCH_PCIE_LTR_LATVAL_HELP                   #language en-US "PCIe S0ix LTR Threshold: Latency Value – This value is multiplied by Latency Scale"
#string STR_PCH_PCIE_NCC_SSC_PROMPT                    #language en-US "Non-Common Clock with SSC Enabled Mode"
#string STR_PCH_PCIE_NCC_SSC_HELP                      #language en-US "Assume the root port is operating at non-common clock with SSC enabled."


